CSI API ETABS v1
cCaseModalRitz.SetInitialCase Method
 This function sets the initial condition for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetInitialCase(
	string Name,
	string InitialCase
)
Function SetInitialCase (
	Name As String,
	InitialCase As String
) As Integer
Dim instance As cCaseModalRitz
Dim Name As String
Dim InitialCase As String
Dim returnValue As Integer
returnValue = instance.SetInitialCase(Name,
	InitialCase)
int SetInitialCase(
	String^ Name,
	String^ InitialCase
)
abstract SetInitialCase :
        Name : string *
        InitialCase : string -> int
Parameters
Name
Type: System.String
 The name of an existing modal Ritz load case.
InitialCase
Type: System.String
 This is blank, None, or the name of an existing analysis case. This item specifies if the load case starts from zero initial conditions, that is, an unstressed state, or if it starts using the stiffness that occurs at the end of a nonlinear static or nonlinear direct integration time history load case.
 If the specified initial case is a nonlinear static or nonlinear direct integration time history load case, the stiffness at the end of that case is used. If the initial case is anything else, zero initial conditions are assumed.
Return Value
Type: Int32
 Returns zero if the initial condition is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim InitialCase As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add static nonlinear load case
    ret = SapModel.LoadCases.StaticNonlinear.SetCase("SN1")
'add modal Ritz load case
    ret = SapModel.LoadCases.ModalRitz.SetCase("LCASE1")
'set initial condition
    ret = SapModel.LoadCases.ModalRitz.SetInitialCase("LCASE1", "SN1")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalRitz Interface
ETABSv1 Namespace